{
    "global": {
        "addToUrl": "fr/",
        "projectsDir": "projets/",
        "frIsActive": "active",
        "enIsActive": "",
        "french": "Français",
        "english": "Anglais"
    },
    "headers" : {
        "lang": "fr"
    },
    "home": {
        "title": "Robin Bécherraz - Développeur web & ingénieur des médias",
        "metaDesc": "Je suis un jeune ingénieur des médias, passionné par le web et la technologie. Jetez un œil à mon portfolio pour en savoir plus sur moi et mon travail",
        "portraitAlt": "Portrait de Robin",
        "catchPhrase1": "Je suis un jeune ingénieur des médias, passionné par le web et la technologie.",
        "catchPhrase2": "Ma formation d'informaticien m'a apporté un grand nombre de compétences techniques, ainsi que de l'expérience professionnelle. J'ai ensuite voulu mettre de côté mon terminal afin d'apprendre au-delà de la technique pure. Cela m'a amené à devenir un développeur web très polyvalent, ayant des compétences en UX, en communication, en marketing, en création de contenu et bien plus.",
        "aboutMe": "À propos de moi",
        "iLiveIn": "Je vis en",
        "whereILive": "Suisse romande",
        "wasBornIn": "Je suis né en",
        "iSpeak": "Je parle",
        "whatISpeak": "Français (langue maternelle) Anglais (B2 à l'oral et à l'ecrit, C1 en compréhension)",
        "education": "Formation",
        "educationContent": "CFC d'informaticien & bachelor en ingénierie des médias",
        "myFavorites": "Mon/ma ... favori/te",
        "myFavoritesContent": "Film: Léon, Série: Mr Robot, Groupe: Moon Hooch, Jeu vidéo: Skyrim, Sport: Esalade de bloc, Couleur: #AE009B",
        "skills": "Compétences",
        "other": "Autre",
        "skillsContent": "Marketing<span class='nbsp'>&nbsp;</span>digital UX/UI Création<span class='nbsp'>&nbsp;</span>de<span class='nbsp'>&nbsp;</span>contenu<span class='nbsp'>&nbsp;</span>(suite<span class='nbsp'>&nbsp;</span>Adobe) Gestion<span class='nbsp'>&nbsp;</span>de<span class='nbsp'>&nbsp;</span>projet",
        "thumbAlt": "Miniature du projet",
        "unavailable": "indisponible",
        "visit": "visiter"
    },
    "projects": {
        "backLabel": "&lt; retour au portfolio",
        "builtIn": "Développé en",
        "addToMetaTitle": "un projet développé par Robin Bécherraz",
        "titleHeader": "Mes projets",
        "RoomForImprovement": "Possibilités d'amélioration",
        "context": "Contexte",
        "func": "Fonctionnalités",
        "goal": "Objectif",
        "problemsSolutions": "Problèmes & Solutions"
    },
    "mooderize": {
        "filename": "mooderize",
        "enFilename": "mooderize",
        "frFilename": "mooderize",
        "title": "Mooderize",
        "titleTag": "Mes Projets - Mooderize",
        "desc": "Application d'effets audio",
        "metaDesc": "Cette SPA permet d'appliquer des effets audio à des fichiers en utilisant la Web Audio API et une API node.js.",
        "sentence1": "Mooderize est une SPA permettant d'ajouter des effets pré-faits à des fichiers audio. Le traitement de l'audio est effectué grâce à la <a href=\"https://developer.mozilla.org/fr/docs/Web/API/Web_Audio_API\" target=\"blank\">Web Audio API</a>. L'app contient également une fonctionnalité pour télécharger de manière asynchrone un fichier audio d'après un lien YouTube grâce à une petite API réalisé avec Node.js et Express.js.",
        "goal1": "Un ami m'a fait découvrir cette tendance des musiques \"but you're in a bathroom\" ou \"but you're in an empty mall\". Ça m'a donné envie de créer une app permettant d'appliquer ces effets audio automatiquement. J'étais du coup curieux de savoir comment faire techniquement pour traiter de l'audio sur le web.",
        "ps1": "Mon premier défi était de trouver une librairie permettant, au moins, d'appliquer des effets d'EQ et de reverb. Et il n'y avait pas tant d'options que ça... J'ai essayé <a href=\"https://github.com/belangeo/pyo\" target=\"blank\">Python PYO</a>, qui était un peu trop compliqué. J'ai également testé <a href=\"https://github.com/carlthome/python-audio-effects\" target=\"blank\">python-audio-effects</a>, et je ne me rappelle honnêtement plus pourquoi je ne l'ai pas utilisé... Mais mon choix final s'est porté sur la librairie <a href=\"https://developer.mozilla.org/fr/docs/Web/API/Web_Audio_API\">Web Audio API</a>. Cette solution a la particularité d'être full frontend.",
        "ps2": "Mon second problème, qui est directement lié au premier, est que la Web Audio API ne permet pas de créer un fichier télechargeable. On ne peut que streamer de l'audio. La seule solution que j'ai trouvé est d'utiliser la librairie <a href=\"https://github.com/mattdiamond/Recorderjs\" target=\"blank\">Recorderjs</a>. Le projet n'est plus maintenu, donc c'est plutôt risqué, mais c'est un petit module utilisé par pas mal de sites et je n'ai trouvé aucune autre solution.",
        "ps3": "Mon troisième challenge était de récupérer l'audio d'une vidéo YouTube à partir d'un lien. Apparemment YouTube n'a pas trop envie qu'on fasse ça donc c'est un peu plus compliqué que ce que je pensais. J'ai trouvé le module <a href=\"https://github.com/fent/node-ytdl\" target=\"blank\">node-ytdl</a> pour Node.js, qui permet de télécharger une vidéo YouTube en plusieurs formats. J'ai donc créé une petite API me permettant de récupérer le fichier avec une requête ajax.",
        "impr1": "Je pense qu'utiliser une librairie backend pour le traitement audio pourrait être intéressant. Car sur mobile, le traitement est très long. Sinon, l'interface pourrait être grandement améliorée. Un autre défi que je me suis lancé était de n'utiliser que du JavaScript \"vanilla\". Mais je n'ai pas pris soin dès le début de mettre en place des routeurs donc la navigation est assez chaotique. Donc une librairie pour gérer la navigation one page n'aurait pas été de trop. Cette application était un peu une expérience, un bac à sable. Donc elle n'est pas forcément très bien finie / peaufinée."   
    },
    "gryonbiketest": {
        "filename": "gryonbiketest",
        "enFilename": "gryonbiketest",
        "frFilename": "gryonbiketest",
        "title": "Gryon Bike Test",
        "titleTag": "Mes Projets - Gryon Bike Test",
        "desc": "Application pour un événement de test de vélos",
        "metaDesc": "Une plateforme développée pour un événement de test de vélos. Un \"Bike Advisor\" pour les visiteurs, et une interface de gestion pour le staff. Développé avec deux autres développeurs en un mois",
        "sentence1": "<a href=\"https://www.bikegryon.ch/\" target=\"blank\">Gryon Bike Test</a> est un évennement de trois jours durant lequel les visiteurs peuvent tester des vélos amenés par différents exposants. J'ai été lead développeur d'une équipe de trois devs durant un projet d'un moi dont le but était de développer un MVP pour cet évènement. Cette application est une interface de gestion pour le staff, et également une sorte de \"<s>Trip</s> Bike advisor\" pour les visiteurs",
        "sentence2": "Vous pouvez tester l'application avec les identifiants suivants:",
        "sentence3": "Le mot de passe est \"password\" pour tous les identifiants",
        "cont1": "Ce projet était le projet de fin de 2e année de bachelor. Le but était de développer, en 20 jours, un MVP fonctionnel pour l'évènement du <a href=\"https://www.bikegryon.ch/\" target=\"blank\">Gryon Bike Test</a>. Ce MVP devait permettre au staff de gérer les inscriptions des visiteurs et la location des vélos.",
        "cont2": "Notre équipe était composée de 5 personnes. Deux ont travaillé sur la partie design / UX, une a principalement travaillé sur le HTML / CSS, et le 4e membre et moi-même avons travaillé principalement sur le backend. J'ai été lead développeur de notre équipe de 3 devs.",
        "cont3": "Ce projet ne consistait pas simplement à coder. Nous avons dû inventer le concept, l'interface et déterminer les fonctionnalités à implémenter",
        "func0": "Voici les fonctionnalités que nous avons implémentées:",
        "func1": "Fonctionnalités pour le staff",
        "func11": "Gestion des utilisateurs et de leurs droits",
        "func2": "Fonctionnalités pour les exposants",
        "func21": "Gestion de leur catalogue de vélos",
        "func22": "Gestion de la location de leurs vélos (Qui a emprunté quel vélo et quand)",
        "func3": "Fonctionnalités pour les visiteurs",
        "func31": "Acheter un billet (La partie paiement n'est volontairement pas fonctionnelle, donc c'est plutôt une inscription) / Connexion",
        "func32": "Consulter les vélos disponibles, leur note et les commentaires",
        "func33": "Noter les vélos qu'ils ont testés par rapport à plusieurs critères",
        "impr1": "L'application est un MVP. Donc beaucoup de fonctionnalités pourraient être ajoutées ou améliorées. Je suis cependant content du code que nous avons produit, bien que parfois, nous acquérions de nouvelles compétences au cours du développement et n'avions pas le temps d'implémenter ce que nous avions appris. La modélisation de la BDD pourrait certainement être améliorée. Pour finir, le design n'est pas tout le temps responsive et la compatibilité cross-browser du CSS devrait être améliorée."
    },
    "theapologist": {
        "filename": "theapologist",
        "enFilename": "theapologist",
        "frFilename": "theapologist",
        "title": "The Apologist",
        "titleTag": "Mes Projets - The Apologist",
        "desc": "Blog de cinéma / culturel",
        "metaDesc": "Refonte du site web the The Apologist.",
        "sentence1": "J'ai été engagé pour modifier le thème WordPress de ce site qui était déjà en production. Le site contenait déjà ~500 articles. J'ai faire plusieurs requêtes SQL dans la BDD de WordPress afin de modifier le contenu de certains articles au nouveaux fonctionnement du nouveau thème. Cela concernait notemment des liens de vidéos YouTube qui étaient des attributs d'articles dans l'ancien thème, et qui devaient dorénavant être integré directement dans le contenu de l'article "
    },
    "automaton": {
        "filename": "automatecellulaire",
        "enFilename": "cellularautomaton",
        "frFilename": "automatecellulaire",
        "title": "Automate cellulaire",
        "titleTag": "Mes projets - Automate cellulaire",
        "desc": "Jeu de la vie configurable",
        "metaDesc": "Un jeu de la vie dans lequel vous pouvez changer les règles de vie et de survie. Développé avec JavaScript et HTML canvas",
        "sentence1": "Ce petit projet est un <a href='https://fr.wikipedia.org/wiki/Automate_cellulaire' target='blank'>Automate Cellulaire</a> paramétrable.",
        "hint": "Astuce:",
        "hint1": "Mettez sur pause en appuyant sur \"P\", puis maintenez \"A\" pour régler le nombre de naissances initiales à 0.",
        "hint2": "Changez les règles en B: 1,3 et S: 1,3",
        "hint3": "Réinitialisez la grille en appuyant sur \"R\", cliquez sur une cellule, puis appuyez sur \"P\" pour redémarrer l'automate.",
        "hint4": "Admirez le mandala animé!"
    },
    "swisssolarboat": {
        "filename": "swisssolarboat",
        "enFilename": "swisssolarboat",
        "frFilename": "swisssolarboat",
        "title": "Swiss Solar Boat",
        "titleTag": "Mes Projets - Swiss Solar Boat",
        "desc": "Site web d'une association",
        "metaDesc": "Site WordPress de l'association Swiss Solar Boat de l'EPFL",
        "sentence1": "J'ai été membre du pôle communication de l'association Swiss Solar Boat de l'EPFL lors de sa création. Un autre membre et moi même étions responsables du site web. Nous avons tout développé avec WordPress et Divi builder, excepté pour la page <a href=\"https://swisssolarboat.ch/team/\" target=\"blank\">Team</a>.",
        "sentence2": "Nous avons utilisé WordPress car nous n'avions pas encore les compétences nécessaires pour développer le site from scratch dans les temps impartis. Mais je ne suis pas un grand fan de WordPress pour de multiples raisons donc je pense que je le développerait avec d'autres technologies si je devais le refaire."
    },
    "myportfolio": {
        "filename": "monportfolio",
        "enFilename": "myportfolio",
        "frFilename": "monportfolio",
        "title": "Mon Portfolio",
        "titleTag": "Mes Projets - Mon Portfolio",
        "desc": "Site statique automatisé et évolutif",
        "metaDesc": "Un site web automatisé et évolutif utilisant des templates Handlebars compilés lors du build de Webpack.",
        "sentence1": "Pour ce projet, j'ai créé un setup d'environnement de développement frontend que vous pouvez retrouver <a href=\"https://github.com/robiiiiiiiiiiiin/HandleBabelSassPack\" target=\"blank\">ici</a>.",
        "sentence2": "J'ai utilisé <a href=\"https://handlebarsjs.com/\" target=\"blank\">Handlebars</a> et <a href=\"https://github.com/sagold/handlebars-webpack-plugin\" target=\"blank\">handlebars-webpack-plugin</a> afin de pouvoir créer des template HTML compilés lors du build de Webpack.  Ainsi, les miniatures des projets de mon portfolio sont générées automatiquement à partir d'un fichier json",
        "cont1": "Je n'avais pas beaucoup de temps pour développer ce site, et je voulais qu'il soit évolutif afin de pouvoir ajouter mes futurs projets facilement. J'avais déjà utilisé Handlebars pour créer des template dynamiquement générés avec JavaScript. Mais pour ce projet, je voulais fournir des pages statiques au client.",
        "cont2": "J'ai trouvé le plugin <a href=\"https://github.com/sagold/handlebars-webpack-plugin\" target=\"blank\">handlebars-webpack-plugin</a>, qui était parfaitement adapté à mon besoin. Je l'ai donc ajouté à ma config Webpack usuelle. J'ai également ajouté Sass que je n'avais encore jamais utilisé (et ce fut une grande révélation). À partir de cette config, j'ai créé <a href=\"https://github.com/robiiiiiiiiiiiin/HandleBabelSassPack\" target=\"blank\">ce setup</a> de développement frontend que je mets à jour régulièrement avec de nouveaux outils, notament d'automatisation.",
        "impr1": "Il faudrait que je trouve un outil pour automatiser l'optimisation des images, afin de les convertir en .webp et de générer automatiquement plusieurs résolutions de la même image"
    },
    "lechodubois": {
        "filename": "lechodubois",
        "enFilename": "lechodubois",
        "frFilename": "lechodubois",
        "title": "L'Echo du Bois",
        "titleTag": "Mes Projets - L'Echo du Bois",
        "desc": "Site vitrine responsive et léger",
        "metaDesc": "Site vitrine responsive utilisant CSS Grid. Images optimisées avec Sharp. Travail attentif sur le SEO.",
        "sentence1": "J'ai designé et développé ce site pour un artisan sur bois de la région de Bulle. Une attention particulière a été portée sur le design responsive et le SEO. Les images sont automatiquement optimisées grâce à un script <a href=\"https://www.npmjs.com/package/sharp\" target=\"blank\">Sharp</a> les convertissant dans plusieurs tailles et dans les formats .jpg et .webm."
    },
    "golb": {
        "filename": "golb",
        "enFilename": "golb",
        "frFilename": "golb",
        "title": "GOLB",
        "titleTag": "Mes Projets - GOLB",
        "desc": "Blog tech personnel",
        "metaDesc": "Blog tech développé avec le framework Gatsby",
        "sentence1": "Ce site statique a été développé avec le framework <a href=\"https://www.gatsbyjs.com/\" target=\"blank\">Gatsby</a>. Je me suis basé sur les fonctionnalités du template <a href=\"https://github.com/gatsbyjs/gatsby-starter-blog\" target=\"blank\">gatsby-starter-blog</a> et y ai ajouté une fonctionnalité de filtrage par catégories, un espace commentaire utilisant <a href=\"https://graphcomment.com\" target=\"blank\">GraphComment</a>, un système de pagination et une interface entièrement personnalisée."
    }
}